[
    {
        "title": "Fundamentos da Saúde Pública 1",
        "description": "Explore o curso 'Fundamentos da Saúde Pública 1' com Carlos Mendes para aprender sobre Introdução à Saúde Pública., Epidemiologia Básica., Políticas de Saúde., Promoção da Saúde Comunitária.. Com início em 2024-11-01, este curso médio inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Carlos Mendes",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-01",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em saúde",
        "reviews": null,
        "average_rating": 3.2,
        "total_reviews": 90,
        "cover_image": "https://example.com/saúde_1.png",
        "course_preview": "https://example.com/saúde_intro_1.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade.",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em análise epidemiológica e compreensão de políticas de saúde., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Introdução à Saúde Pública.",
                "Módulo 2": "Epidemiologia Básica.",
                "Módulo 3": "Políticas de Saúde.",
                "Módulo 4": "Promoção da Saúde Comunitária."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online. Os módulos serão disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas sessões plenárias e oficinas práticas focadas na análise de práticas de saúde pública, estudos de caso e estratégias de intervenção. Serão utilizadas ferramentas como videoconferências síncronas e atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-02-23",
        "id": 1
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 2",
        "description": "Inscreva-se no curso 'Metodologias Ativas de Aprendizagem 2', ministrado por Maria Fernandes, para uma imersão em temas como Fundamentos das Metodologias Ativas., Técnicas de Engajamento de Alunos., Ferramentas Digitais para Educação., Avaliação de Resultados de Aprendizagem.. Começando em 2024-11-02, este curso longo utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Testes teóricos e projetos práticos.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Maria Fernandes",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-02",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.6,
        "total_reviews": 12,
        "cover_image": "https://example.com/educação_2.png",
        "course_preview": "https://example.com/educação_intro_2.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em aplicar metodologias ativas e engajar alunos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Fundamentos das Metodologias Ativas.",
                "Módulo 2": "Técnicas de Engajamento de Alunos.",
                "Módulo 3": "Ferramentas Digitais para Educação.",
                "Módulo 4": "Avaliação de Resultados de Aprendizagem."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas e estudos de caso, enfatizando a análise crítica de políticas de saúde. Sessões síncronas e atividades assíncronas complementam a formação, promovendo uma compreensão abrangente dos desafios da saúde pública.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-05-13",
        "id": 2
    },
    {
        "title": "Introdução à Análise de Negócios 3",
        "description": "Participe do curso 'Introdução à Análise de Negócios 3' com João Silva para explorar tópicos como Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Este curso, começando em 2024-11-03, tem uma duração médio e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "João Silva",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-03",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em negócios",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.9,
        "total_reviews": 22,
        "cover_image": "https://example.com/negócios_3.png",
        "course_preview": "https://example.com/negócios_intro_3.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de saúde pública. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-09-12",
        "updatedAt": "2024-06-07",
        "id": 3
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 4",
        "description": "Explore o curso 'Estratégias de Sustentabilidade Empresarial 4' com Ana Costa para aprender sobre Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Com início em 2024-11-04, este curso longo inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Ana Costa",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-04",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.0,
        "total_reviews": 13,
        "cover_image": "https://example.com/sustentabilidade_4.png",
        "course_preview": "https://example.com/sustentabilidade_intro_4.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "O curso adota uma abordagem b-learning, combinando sessões presenciais e online, com módulos disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso, focando na educação intercultural e plurilinguismo. Ferramentas de videoconferência serão utilizadas para sessões síncronas, e atividades assíncronas serão conduzidas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-05-23",
        "id": 4
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 5",
        "description": "Neste curso, 'Desenvolvimento de Aplicações Móveis 5', ministrado por Ricardo Santos, você aprenderá sobre Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Com início em 2024-11-05, este curso médio será conduzido através de O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Ricardo Santos",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-05",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em tecnologia",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.9,
        "total_reviews": 37,
        "cover_image": "https://example.com/tecnologia_5.png",
        "course_preview": "https://example.com/tecnologia_intro_5.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Desenvolver competências em programação para plataformas Android e iOS;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "Este curso utiliza metodologias b-learning, com módulos acessíveis online e sessões presenciais. As plenárias e oficinas práticas abordarão teorias educacionais e práticas interculturais, usando estudos de caso para ilustrar conceitos. Sessões síncronas e atividades assíncronas no ambiente virtual serão componentes chave do curso.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-04",
        "updatedAt": "2023-10-25",
        "id": 5
    },
    {
        "title": "Fundamentos da Saúde Pública 6",
        "description": "Neste curso, 'Fundamentos da Saúde Pública 6', ministrado por Prof. Saúde 6, você aprenderá sobre Saúde Comunitária., Avanços em Epidemiologia., Implementação de Políticas de Saúde., Projetos de Promoção da Saúde.. Com início em 2024-11-06, este curso longo será conduzido através de O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 6",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-06",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.4,
        "total_reviews": 61,
        "cover_image": "https://example.com/saúde_6.png",
        "course_preview": "https://example.com/saúde_intro_6.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de promover saúde comunitária e habilidades em pesquisa epidemiológica., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Saúde Comunitária.",
                "Módulo 2": "Avanços em Epidemiologia.",
                "Módulo 3": "Implementação de Políticas de Saúde.",
                "Módulo 4": "Projetos de Promoção da Saúde."
            },
            "methodologies": "Desenvolvido na modalidade b-learning, o curso oferece uma combinação de sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e análise de casos no contexto da educação intercultural. Sessões síncronas e atividades assíncronas suportarão a formação contínua.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-20",
        "id": 6
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 7",
        "description": "Participe do curso 'Metodologias Ativas de Aprendizagem 7' com Prof. Educação 7 para explorar tópicos como Novas Metodologias de Ensino., Engajamento em Sala de Aula., Uso de Tecnologia na Educação., Melhoria de Resultados Educacionais.. Este curso, começando em 2024-11-07, tem uma duração médio e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Projetos práticos e uso de tecnologias educacionais., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Projetos práticos e apresentações.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 7",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-07",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em educação",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.7,
        "total_reviews": 45,
        "cover_image": "https://example.com/educação_7.png",
        "course_preview": "https://example.com/educação_intro_7.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de inovar no ensino e engajar alunos em diferentes contextos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Novas Metodologias de Ensino.",
                "Módulo 2": "Engajamento em Sala de Aula.",
                "Módulo 3": "Uso de Tecnologia na Educação.",
                "Módulo 4": "Melhoria de Resultados Educacionais."
            },
            "methodologies": "O curso será conduzido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em análise financeira e gestão estratégica. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-10-05",
        "updatedAt": "2023-09-01",
        "id": 7
    },
    {
        "title": "Introdução à Análise de Negócios 8",
        "description": "Neste curso, 'Introdução à Análise de Negócios 8', ministrado por Prof. Negócios 8, você aprenderá sobre Introdução à Análise de Negócios., Planejamento Estratégico., Análise Financeira., Gestão de Projetos.. Com início em 2024-11-08, este curso longo será conduzido através de O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre negócios e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 8",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-08",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.2,
        "total_reviews": 11,
        "cover_image": "https://example.com/negócios_8.png",
        "course_preview": "https://example.com/negócios_intro_8.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Investigar as tendências globais de negócios e suas implicações locais;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em planejamento estratégico e gestão de projetos., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Introdução à Análise de Negócios.",
                "Módulo 2": "Planejamento Estratégico.",
                "Módulo 3": "Análise Financeira.",
                "Módulo 4": "Gestão de Projetos."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando estratégias de negócios e inovação. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática dos desafios empresariais.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre negócios e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-10-03",
        "updatedAt": "2023-09-06",
        "id": 8
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 9",
        "description": "Inscreva-se no curso 'Estratégias de Sustentabilidade Empresarial 9', ministrado por Prof. Sustentabilidade 9, para uma imersão em temas como Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Começando em 2024-11-09, este curso médio utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 9",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-09",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em sustentabilidade",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.3,
        "total_reviews": 66,
        "cover_image": "https://example.com/sustentabilidade_9.png",
        "course_preview": "https://example.com/sustentabilidade_intro_9.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Propor políticas públicas que incentivem práticas sustentáveis;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de gestão de negócios. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-10-16",
        "updatedAt": "2023-09-25",
        "id": 9
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 10",
        "description": "O curso 'Desenvolvimento de Aplicações Móveis 10', oferecido por Prof. Tecnologia 10, aborda temas cruciais como Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Com duração longo e início em 2024-11-10, os alunos irão se beneficiar de metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será baseada em A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., com uma bibliografia composta por A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 10",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-10",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 3.3,
        "total_reviews": 48,
        "cover_image": "https://example.com/tecnologia_10.png",
        "course_preview": "https://example.com/tecnologia_intro_10.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em práticas sustentáveis e gestão ambiental. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-11-24",
        "id": 10
    },
    {
        "title": "Fundamentos da Saúde Pública 11",
        "description": "Neste curso, 'Fundamentos da Saúde Pública 11', ministrado por Prof. Saúde 11, você aprenderá sobre Introdução à Saúde Pública., Epidemiologia Básica., Políticas de Saúde., Promoção da Saúde Comunitária.. Com início em 2024-11-11, este curso médio será conduzido através de O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 11",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-11",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em saúde",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.6,
        "total_reviews": 23,
        "cover_image": "https://example.com/saúde_11.png",
        "course_preview": "https://example.com/saúde_intro_11.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade.",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em análise epidemiológica e compreensão de políticas de saúde., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Introdução à Saúde Pública.",
                "Módulo 2": "Epidemiologia Básica.",
                "Módulo 3": "Políticas de Saúde.",
                "Módulo 4": "Promoção da Saúde Comunitária."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando estratégias de sustentabilidade e inovação. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática dos desafios ambientais.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-04-05",
        "updatedAt": "2023-09-01",
        "id": 11
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 12",
        "description": "Participe do curso 'Metodologias Ativas de Aprendizagem 12' com Prof. Educação 12 para explorar tópicos como Fundamentos das Metodologias Ativas., Técnicas de Engajamento de Alunos., Ferramentas Digitais para Educação., Avaliação de Resultados de Aprendizagem.. Este curso, começando em 2024-11-12, tem uma duração longo e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Testes teóricos e projetos práticos.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 12",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-12",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.0,
        "total_reviews": 76,
        "cover_image": "https://example.com/educação_12.png",
        "course_preview": "https://example.com/educação_intro_12.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em aplicar metodologias ativas e engajar alunos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Fundamentos das Metodologias Ativas.",
                "Módulo 2": "Técnicas de Engajamento de Alunos.",
                "Módulo 3": "Ferramentas Digitais para Educação.",
                "Módulo 4": "Avaliação de Resultados de Aprendizagem."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de sustentabilidade. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-06-03",
        "updatedAt": "2023-08-30",
        "id": 12
    },
    {
        "title": "Introdução à Análise de Negócios 13",
        "description": "Inscreva-se no curso 'Introdução à Análise de Negócios 13', ministrado por Prof. Negócios 13, para uma imersão em temas como Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Começando em 2024-11-13, este curso médio utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 13",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-13",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em negócios",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.2,
        "total_reviews": 26,
        "cover_image": "https://example.com/negócios_13.png",
        "course_preview": "https://example.com/negócios_intro_13.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em desenvolvimento de aplicações móveis. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-06-15",
        "updatedAt": "2023-12-09",
        "id": 13
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 14",
        "description": "Participe do curso 'Estratégias de Sustentabilidade Empresarial 14' com Prof. Sustentabilidade 14 para explorar tópicos como Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Este curso, começando em 2024-11-14, tem uma duração longo e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 14",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-14",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.5,
        "total_reviews": 75,
        "cover_image": "https://example.com/sustentabilidade_14.png",
        "course_preview": "https://example.com/sustentabilidade_intro_14.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando design UX/UI e programação móvel. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática do desenvolvimento de aplicativos.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-06-26",
        "id": 14
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 15",
        "description": "Neste curso, 'Desenvolvimento de Aplicações Móveis 15', ministrado por Prof. Tecnologia 15, você aprenderá sobre Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Com início em 2024-11-15, este curso médio será conduzido através de O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 15",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-15",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em tecnologia",
        "reviews": null,
        "average_rating": 4.2,
        "total_reviews": 67,
        "cover_image": "https://example.com/tecnologia_15.png",
        "course_preview": "https://example.com/tecnologia_intro_15.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de desenvolvimento tecnológico. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-04-24",
        "id": 15
    },
    {
        "title": "Fundamentos da Saúde Pública 16",
        "description": "Inscreva-se no curso 'Fundamentos da Saúde Pública 16', ministrado por Prof. Saúde 16, para uma imersão em temas como Introdução à Saúde Pública., Epidemiologia Básica., Políticas de Saúde., Promoção da Saúde Comunitária.. Começando em 2024-11-16, este curso longo utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 16",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-16",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.6,
        "total_reviews": 98,
        "cover_image": "https://example.com/saúde_16.png",
        "course_preview": "https://example.com/saúde_intro_16.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade.",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em análise epidemiológica e compreensão de políticas de saúde., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Introdução à Saúde Pública.",
                "Módulo 2": "Epidemiologia Básica.",
                "Módulo 3": "Políticas de Saúde.",
                "Módulo 4": "Promoção da Saúde Comunitária."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online. Os módulos serão disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas sessões plenárias e oficinas práticas focadas na análise de práticas de saúde pública, estudos de caso e estratégias de intervenção. Serão utilizadas ferramentas como videoconferências síncronas e atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-04-22",
        "updatedAt": "2023-11-01",
        "id": 16
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 17",
        "description": "Inscreva-se no curso 'Metodologias Ativas de Aprendizagem 17', ministrado por Prof. Educação 17, para uma imersão em temas como Fundamentos das Metodologias Ativas., Técnicas de Engajamento de Alunos., Ferramentas Digitais para Educação., Avaliação de Resultados de Aprendizagem.. Começando em 2024-11-17, este curso médio utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Testes teóricos e projetos práticos.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 17",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-17",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em educação",
        "reviews": null,
        "average_rating": 4.8,
        "total_reviews": 27,
        "cover_image": "https://example.com/educação_17.png",
        "course_preview": "https://example.com/educação_intro_17.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em aplicar metodologias ativas e engajar alunos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Fundamentos das Metodologias Ativas.",
                "Módulo 2": "Técnicas de Engajamento de Alunos.",
                "Módulo 3": "Ferramentas Digitais para Educação.",
                "Módulo 4": "Avaliação de Resultados de Aprendizagem."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas e estudos de caso, enfatizando a análise crítica de políticas de saúde. Sessões síncronas e atividades assíncronas complementam a formação, promovendo uma compreensão abrangente dos desafios da saúde pública.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-06-25",
        "id": 17
    },
    {
        "title": "Introdução à Análise de Negócios 18",
        "description": "Explore o curso 'Introdução à Análise de Negócios 18' com Prof. Negócios 18 para aprender sobre Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Com início em 2024-11-18, este curso longo inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 18",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-18",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 3.9,
        "total_reviews": 42,
        "cover_image": "https://example.com/negócios_18.png",
        "course_preview": "https://example.com/negócios_intro_18.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de saúde pública. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-27",
        "id": 18
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 19",
        "description": "Neste curso, 'Estratégias de Sustentabilidade Empresarial 19', ministrado por Prof. Sustentabilidade 19, você aprenderá sobre Sustentabilidade Avançada., Recursos Renováveis., Inovação em Sustentabilidade., Estudos de Impacto Ambiental.. Com início em 2024-11-19, este curso médio será conduzido através de O curso utilizará metodologias diversificadas, incluindo Projetos práticos e uso de ferramentas de sustentabilidade., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Recursos online e workshops com profissionais de sustentabilidade., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 19",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-19",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em sustentabilidade",
        "reviews": null,
        "average_rating": 4.7,
        "total_reviews": 66,
        "cover_image": "https://example.com/sustentabilidade_19.png",
        "course_preview": "https://example.com/sustentabilidade_intro_19.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de desenvolver estratégias sustentáveis e realizar análises ambientais., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Sustentabilidade Avançada.",
                "Módulo 2": "Recursos Renováveis.",
                "Módulo 3": "Inovação em Sustentabilidade.",
                "Módulo 4": "Estudos de Impacto Ambiental."
            },
            "methodologies": "O curso adota uma abordagem b-learning, combinando sessões presenciais e online, com módulos disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso, focando na educação intercultural e plurilinguismo. Ferramentas de videoconferência serão utilizadas para sessões síncronas, e atividades assíncronas serão conduzidas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Recursos online e workshops com profissionais de sustentabilidade., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-23",
        "id": 19
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 20",
        "description": "Inscreva-se no curso 'Desenvolvimento de Aplicações Móveis 20', ministrado por Prof. Tecnologia 20, para uma imersão em temas como Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Começando em 2024-11-20, este curso longo utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 20",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-20",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.5,
        "total_reviews": 99,
        "cover_image": "https://example.com/tecnologia_20.png",
        "course_preview": "https://example.com/tecnologia_intro_20.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Desenvolver competências em programação para plataformas Android e iOS;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "Este curso utiliza metodologias b-learning, com módulos acessíveis online e sessões presenciais. As plenárias e oficinas práticas abordarão teorias educacionais e práticas interculturais, usando estudos de caso para ilustrar conceitos. Sessões síncronas e atividades assíncronas no ambiente virtual serão componentes chave do curso.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-03-11",
        "updatedAt": "2024-02-16",
        "id": 20
    },
    {
        "title": "Fundamentos da Saúde Pública 21",
        "description": "Inscreva-se no curso 'Fundamentos da Saúde Pública 21', ministrado por Prof. Saúde 21, para uma imersão em temas como Saúde Comunitária., Avanços em Epidemiologia., Implementação de Políticas de Saúde., Projetos de Promoção da Saúde.. Começando em 2024-11-21, este curso médio utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 21",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-21",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em saúde",
        "reviews": null,
        "average_rating": 3.6,
        "total_reviews": 20,
        "cover_image": "https://example.com/saúde_21.png",
        "course_preview": "https://example.com/saúde_intro_21.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade.",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de promover saúde comunitária e habilidades em pesquisa epidemiológica., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Saúde Comunitária.",
                "Módulo 2": "Avanços em Epidemiologia.",
                "Módulo 3": "Implementação de Políticas de Saúde.",
                "Módulo 4": "Projetos de Promoção da Saúde."
            },
            "methodologies": "Desenvolvido na modalidade b-learning, o curso oferece uma combinação de sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e análise de casos no contexto da educação intercultural. Sessões síncronas e atividades assíncronas suportarão a formação contínua.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-03-22",
        "id": 21
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 22",
        "description": "Inscreva-se no curso 'Metodologias Ativas de Aprendizagem 22', ministrado por Prof. Educação 22, para uma imersão em temas como Novas Metodologias de Ensino., Engajamento em Sala de Aula., Uso de Tecnologia na Educação., Melhoria de Resultados Educacionais.. Começando em 2024-11-22, este curso longo utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Projetos práticos e uso de tecnologias educacionais., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Projetos práticos e apresentações.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 22",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-22",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.1,
        "total_reviews": 13,
        "cover_image": "https://example.com/educação_22.png",
        "course_preview": "https://example.com/educação_intro_22.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de inovar no ensino e engajar alunos em diferentes contextos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Novas Metodologias de Ensino.",
                "Módulo 2": "Engajamento em Sala de Aula.",
                "Módulo 3": "Uso de Tecnologia na Educação.",
                "Módulo 4": "Melhoria de Resultados Educacionais."
            },
            "methodologies": "O curso será conduzido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em análise financeira e gestão estratégica. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-01-18",
        "updatedAt": "2023-09-01",
        "id": 22
    },
    {
        "title": "Introdução à Análise de Negócios 23",
        "description": "O curso 'Introdução à Análise de Negócios 23', oferecido por Prof. Negócios 23, aborda temas cruciais como Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Com duração médio e início em 2024-11-23, os alunos irão se beneficiar de metodologias como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será baseada em A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., com uma bibliografia composta por A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 23",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-23",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em negócios",
        "reviews": null,
        "average_rating": 3.4,
        "total_reviews": 63,
        "cover_image": "https://example.com/negócios_23.png",
        "course_preview": "https://example.com/negócios_intro_23.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando estratégias de negócios e inovação. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática dos desafios empresariais.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-09-12",
        "id": 23
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 24",
        "description": "Inscreva-se no curso 'Estratégias de Sustentabilidade Empresarial 24', ministrado por Prof. Sustentabilidade 24, para uma imersão em temas como Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Começando em 2024-11-24, este curso longo utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 24",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-24",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.1,
        "total_reviews": 92,
        "cover_image": "https://example.com/sustentabilidade_24.png",
        "course_preview": "https://example.com/sustentabilidade_intro_24.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de gestão de negócios. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-04-28",
        "updatedAt": "2024-01-18",
        "id": 24
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 25",
        "description": "O curso 'Desenvolvimento de Aplicações Móveis 25', oferecido por Prof. Tecnologia 25, aborda temas cruciais como Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Com duração médio e início em 2024-11-25, os alunos irão se beneficiar de metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será baseada em A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., com uma bibliografia composta por A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 25",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-25",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em tecnologia",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.6,
        "total_reviews": 84,
        "cover_image": "https://example.com/tecnologia_25.png",
        "course_preview": "https://example.com/tecnologia_intro_25.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Implementar estratégias de teste e otimização de aplicativos móveis;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em práticas sustentáveis e gestão ambiental. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-11-05",
        "updatedAt": "2024-01-06",
        "id": 25
    },
    {
        "title": "Fundamentos da Saúde Pública 26",
        "description": "Inscreva-se no curso 'Fundamentos da Saúde Pública 26', ministrado por Prof. Saúde 26, para uma imersão em temas como Saúde Comunitária., Avanços em Epidemiologia., Implementação de Políticas de Saúde., Projetos de Promoção da Saúde.. Começando em 2024-11-26, este curso longo utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 26",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-26",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.8,
        "total_reviews": 91,
        "cover_image": "https://example.com/saúde_26.png",
        "course_preview": "https://example.com/saúde_intro_26.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de promover saúde comunitária e habilidades em pesquisa epidemiológica., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Saúde Comunitária.",
                "Módulo 2": "Avanços em Epidemiologia.",
                "Módulo 3": "Implementação de Políticas de Saúde.",
                "Módulo 4": "Projetos de Promoção da Saúde."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando estratégias de sustentabilidade e inovação. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática dos desafios ambientais.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-01-27",
        "id": 26
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 27",
        "description": "Explore o curso 'Metodologias Ativas de Aprendizagem 27' com Prof. Educação 27 para aprender sobre Novas Metodologias de Ensino., Engajamento em Sala de Aula., Uso de Tecnologia na Educação., Melhoria de Resultados Educacionais.. Com início em 2024-11-27, este curso médio inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Projetos práticos e uso de tecnologias educacionais., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Projetos práticos e apresentações.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 27",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-27",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em educação",
        "reviews": null,
        "average_rating": 4.3,
        "total_reviews": 91,
        "cover_image": "https://example.com/educação_27.png",
        "course_preview": "https://example.com/educação_intro_27.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de inovar no ensino e engajar alunos em diferentes contextos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Novas Metodologias de Ensino.",
                "Módulo 2": "Engajamento em Sala de Aula.",
                "Módulo 3": "Uso de Tecnologia na Educação.",
                "Módulo 4": "Melhoria de Resultados Educacionais."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de sustentabilidade. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-06-21",
        "id": 27
    },
    {
        "title": "Introdução à Análise de Negócios 28",
        "description": "Explore o curso 'Introdução à Análise de Negócios 28' com Prof. Negócios 28 para aprender sobre Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Com início em 2024-11-28, este curso longo inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 28",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-28",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.3,
        "total_reviews": 97,
        "cover_image": "https://example.com/negócios_28.png",
        "course_preview": "https://example.com/negócios_intro_28.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em desenvolvimento de aplicações móveis. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-05-16",
        "updatedAt": "2023-12-11",
        "id": 28
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 29",
        "description": "Explore o curso 'Estratégias de Sustentabilidade Empresarial 29' com Prof. Sustentabilidade 29 para aprender sobre Sustentabilidade Avançada., Recursos Renováveis., Inovação em Sustentabilidade., Estudos de Impacto Ambiental.. Com início em 2024-11-29, este curso médio inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Projetos práticos e uso de ferramentas de sustentabilidade., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Recursos online e workshops com profissionais de sustentabilidade., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 29",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-29",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em sustentabilidade",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.2,
        "total_reviews": 91,
        "cover_image": "https://example.com/sustentabilidade_29.png",
        "course_preview": "https://example.com/sustentabilidade_intro_29.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Investigar as interações entre economia, sociedade e meio ambiente;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de desenvolver estratégias sustentáveis e realizar análises ambientais., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Sustentabilidade Avançada.",
                "Módulo 2": "Recursos Renováveis.",
                "Módulo 3": "Inovação em Sustentabilidade.",
                "Módulo 4": "Estudos de Impacto Ambiental."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando design UX/UI e programação móvel. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática do desenvolvimento de aplicativos.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Recursos online e workshops com profissionais de sustentabilidade., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-03-13",
        "updatedAt": "2023-11-05",
        "id": 29
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 30",
        "description": "Participe do curso 'Desenvolvimento de Aplicações Móveis 30' com Prof. Tecnologia 30 para explorar tópicos como Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Este curso, começando em 2024-11-30, tem uma duração longo e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 30",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-30",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 3.9,
        "total_reviews": 31,
        "cover_image": "https://example.com/tecnologia_30.png",
        "course_preview": "https://example.com/tecnologia_intro_30.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de desenvolvimento tecnológico. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-15",
        "id": 30
    },
    {
        "title": "Fundamentos da Saúde Pública 31",
        "description": "O curso 'Fundamentos da Saúde Pública 31', oferecido por Prof. Saúde 31, aborda temas cruciais como Introdução à Saúde Pública., Epidemiologia Básica., Políticas de Saúde., Promoção da Saúde Comunitária.. Com duração médio e início em 2024-11-31, os alunos irão se beneficiar de metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será baseada em A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., com uma bibliografia composta por A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 31",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-31",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em saúde",
        "reviews": null,
        "average_rating": 4.3,
        "total_reviews": 45,
        "cover_image": "https://example.com/saúde_31.png",
        "course_preview": "https://example.com/saúde_intro_31.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em análise epidemiológica e compreensão de políticas de saúde., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Introdução à Saúde Pública.",
                "Módulo 2": "Epidemiologia Básica.",
                "Módulo 3": "Políticas de Saúde.",
                "Módulo 4": "Promoção da Saúde Comunitária."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online. Os módulos serão disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas sessões plenárias e oficinas práticas focadas na análise de práticas de saúde pública, estudos de caso e estratégias de intervenção. Serão utilizadas ferramentas como videoconferências síncronas e atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-15",
        "id": 31
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 32",
        "description": "Explore o curso 'Metodologias Ativas de Aprendizagem 32' com Prof. Educação 32 para aprender sobre Fundamentos das Metodologias Ativas., Técnicas de Engajamento de Alunos., Ferramentas Digitais para Educação., Avaliação de Resultados de Aprendizagem.. Com início em 2024-11-32, este curso longo inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Testes teóricos e projetos práticos.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 32",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-32",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.0,
        "total_reviews": 44,
        "cover_image": "https://example.com/educação_32.png",
        "course_preview": "https://example.com/educação_intro_32.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Explorar as relações entre teoria educacional e prática pedagógica;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em aplicar metodologias ativas e engajar alunos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Fundamentos das Metodologias Ativas.",
                "Módulo 2": "Técnicas de Engajamento de Alunos.",
                "Módulo 3": "Ferramentas Digitais para Educação.",
                "Módulo 4": "Avaliação de Resultados de Aprendizagem."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas e estudos de caso, enfatizando a análise crítica de políticas de saúde. Sessões síncronas e atividades assíncronas complementam a formação, promovendo uma compreensão abrangente dos desafios da saúde pública.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-09-27",
        "updatedAt": "2023-11-10",
        "id": 32
    },
    {
        "title": "Introdução à Análise de Negócios 33",
        "description": "Inscreva-se no curso 'Introdução à Análise de Negócios 33', ministrado por Prof. Negócios 33, para uma imersão em temas como Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Começando em 2024-11-33, este curso médio utiliza metodologias como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação inclui A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia do curso é composta por A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 33",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-33",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em negócios",
        "reviews": null,
        "average_rating": 3.6,
        "total_reviews": 36,
        "cover_image": "https://example.com/negócios_33.png",
        "course_preview": "https://example.com/negócios_intro_33.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de saúde pública. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-11-27",
        "id": 33
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 34",
        "description": "Explore o curso 'Estratégias de Sustentabilidade Empresarial 34' com Prof. Sustentabilidade 34 para aprender sobre Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Com início em 2024-11-34, este curso longo inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 34",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-34",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.5,
        "total_reviews": 98,
        "cover_image": "https://example.com/sustentabilidade_34.png",
        "course_preview": "https://example.com/sustentabilidade_intro_34.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "O curso adota uma abordagem b-learning, combinando sessões presenciais e online, com módulos disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso, focando na educação intercultural e plurilinguismo. Ferramentas de videoconferência serão utilizadas para sessões síncronas, e atividades assíncronas serão conduzidas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-10-10",
        "id": 34
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 35",
        "description": "Participe do curso 'Desenvolvimento de Aplicações Móveis 35' com Prof. Tecnologia 35 para explorar tópicos como Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Este curso, começando em 2024-11-35, tem uma duração médio e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 35",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-35",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em tecnologia",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.1,
        "total_reviews": 57,
        "cover_image": "https://example.com/tecnologia_35.png",
        "course_preview": "https://example.com/tecnologia_intro_35.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Investigar as melhores práticas para publicação e monetização de aplicativos;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "Este curso utiliza metodologias b-learning, com módulos acessíveis online e sessões presenciais. As plenárias e oficinas práticas abordarão teorias educacionais e práticas interculturais, usando estudos de caso para ilustrar conceitos. Sessões síncronas e atividades assíncronas no ambiente virtual serão componentes chave do curso.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-01",
        "updatedAt": "2023-11-14",
        "id": 35
    },
    {
        "title": "Fundamentos da Saúde Pública 36",
        "description": "Neste curso, 'Fundamentos da Saúde Pública 36', ministrado por Prof. Saúde 36, você aprenderá sobre Introdução à Saúde Pública., Epidemiologia Básica., Políticas de Saúde., Promoção da Saúde Comunitária.. Com início em 2024-11-36, este curso longo será conduzido através de O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 36",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-36",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.4,
        "total_reviews": 80,
        "cover_image": "https://example.com/saúde_36.png",
        "course_preview": "https://example.com/saúde_intro_36.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade.",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em análise epidemiológica e compreensão de políticas de saúde., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Introdução à Saúde Pública.",
                "Módulo 2": "Epidemiologia Básica.",
                "Módulo 3": "Políticas de Saúde.",
                "Módulo 4": "Promoção da Saúde Comunitária."
            },
            "methodologies": "Desenvolvido na modalidade b-learning, o curso oferece uma combinação de sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e análise de casos no contexto da educação intercultural. Sessões síncronas e atividades assíncronas suportarão a formação contínua.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre saúde pública e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-03-26",
        "updatedAt": "2023-07-29",
        "id": 36
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 37",
        "description": "Participe do curso 'Metodologias Ativas de Aprendizagem 37' com Prof. Educação 37 para explorar tópicos como Fundamentos das Metodologias Ativas., Técnicas de Engajamento de Alunos., Ferramentas Digitais para Educação., Avaliação de Resultados de Aprendizagem.. Este curso, começando em 2024-11-37, tem uma duração médio e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Testes teóricos e projetos práticos.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 37",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-37",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em educação",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.4,
        "total_reviews": 87,
        "cover_image": "https://example.com/educação_37.png",
        "course_preview": "https://example.com/educação_intro_37.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em aplicar metodologias ativas e engajar alunos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Fundamentos das Metodologias Ativas.",
                "Módulo 2": "Técnicas de Engajamento de Alunos.",
                "Módulo 3": "Ferramentas Digitais para Educação.",
                "Módulo 4": "Avaliação de Resultados de Aprendizagem."
            },
            "methodologies": "O curso será conduzido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em análise financeira e gestão estratégica. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre educação e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-09-13",
        "updatedAt": "2023-07-22",
        "id": 37
    },
    {
        "title": "Introdução à Análise de Negócios 38",
        "description": "Neste curso, 'Introdução à Análise de Negócios 38', ministrado por Prof. Negócios 38, você aprenderá sobre Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Com início em 2024-11-38, este curso longo será conduzido através de O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 38",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-38",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.6,
        "total_reviews": 17,
        "cover_image": "https://example.com/negócios_38.png",
        "course_preview": "https://example.com/negócios_intro_38.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando estratégias de negócios e inovação. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática dos desafios empresariais.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-11-23",
        "updatedAt": "2024-01-22",
        "id": 38
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 39",
        "description": "O curso 'Estratégias de Sustentabilidade Empresarial 39', oferecido por Prof. Sustentabilidade 39, aborda temas cruciais como Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Com duração médio e início em 2024-11-39, os alunos irão se beneficiar de metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será baseada em A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., com uma bibliografia composta por A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 39",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-39",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em sustentabilidade",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.1,
        "total_reviews": 67,
        "cover_image": "https://example.com/sustentabilidade_39.png",
        "course_preview": "https://example.com/sustentabilidade_intro_39.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de gestão de negócios. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-01-28",
        "updatedAt": "2024-05-26",
        "id": 39
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 40",
        "description": "Neste curso, 'Desenvolvimento de Aplicações Móveis 40', ministrado por Prof. Tecnologia 40, você aprenderá sobre Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Com início em 2024-11-40, este curso longo será conduzido através de O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 40",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-40",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.5,
        "total_reviews": 82,
        "cover_image": "https://example.com/tecnologia_40.png",
        "course_preview": "https://example.com/tecnologia_intro_40.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes."
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em práticas sustentáveis e gestão ambiental. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-05-01",
        "updatedAt": "2023-10-01",
        "id": 40
    },
    {
        "title": "Fundamentos da Saúde Pública 41",
        "description": "Neste curso, 'Fundamentos da Saúde Pública 41', ministrado por Prof. Saúde 41, você aprenderá sobre Saúde Comunitária., Avanços em Epidemiologia., Implementação de Políticas de Saúde., Projetos de Promoção da Saúde.. Com início em 2024-11-41, este curso médio será conduzido através de O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 41",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-41",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em saúde",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.4,
        "total_reviews": 59,
        "cover_image": "https://example.com/saúde_41.png",
        "course_preview": "https://example.com/saúde_intro_41.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade.",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de promover saúde comunitária e habilidades em pesquisa epidemiológica., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Saúde Comunitária.",
                "Módulo 2": "Avanços em Epidemiologia.",
                "Módulo 3": "Implementação de Políticas de Saúde.",
                "Módulo 4": "Projetos de Promoção da Saúde."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando estratégias de sustentabilidade e inovação. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática dos desafios ambientais.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-02-02",
        "updatedAt": "2024-01-28",
        "id": 41
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 42",
        "description": "Participe do curso 'Metodologias Ativas de Aprendizagem 42' com Prof. Educação 42 para explorar tópicos como Novas Metodologias de Ensino., Engajamento em Sala de Aula., Uso de Tecnologia na Educação., Melhoria de Resultados Educacionais.. Este curso, começando em 2024-11-42, tem uma duração longo e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Projetos práticos e uso de tecnologias educacionais., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Projetos práticos e apresentações.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 42",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-42",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.4,
        "total_reviews": 29,
        "cover_image": "https://example.com/educação_42.png",
        "course_preview": "https://example.com/educação_intro_42.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de inovar no ensino e engajar alunos em diferentes contextos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Novas Metodologias de Ensino.",
                "Módulo 2": "Engajamento em Sala de Aula.",
                "Módulo 3": "Uso de Tecnologia na Educação.",
                "Módulo 4": "Melhoria de Resultados Educacionais."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de sustentabilidade. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-01-24",
        "updatedAt": "2024-04-16",
        "id": 42
    },
    {
        "title": "Introdução à Análise de Negócios 43",
        "description": "Participe do curso 'Introdução à Análise de Negócios 43' com Prof. Negócios 43 para explorar tópicos como Introdução à Análise de Negócios., Planejamento Estratégico., Análise Financeira., Gestão de Projetos.. Este curso, começando em 2024-11-43, tem uma duração médio e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Livros sobre negócios e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 43",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-43",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em negócios",
        "reviews": null,
        "average_rating": 4.4,
        "total_reviews": 28,
        "cover_image": "https://example.com/negócios_43.png",
        "course_preview": "https://example.com/negócios_intro_43.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em planejamento estratégico e gestão de projetos., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Introdução à Análise de Negócios.",
                "Módulo 2": "Planejamento Estratégico.",
                "Módulo 3": "Análise Financeira.",
                "Módulo 4": "Gestão de Projetos."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online, com módulos disponíveis em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso focados em desenvolvimento de aplicações móveis. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre negócios e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-11-19",
        "id": 43
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 44",
        "description": "Neste curso, 'Estratégias de Sustentabilidade Empresarial 44', ministrado por Prof. Sustentabilidade 44, você aprenderá sobre Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Com início em 2024-11-44, este curso longo será conduzido através de O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 44",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-44",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 3.6,
        "total_reviews": 21,
        "cover_image": "https://example.com/sustentabilidade_44.png",
        "course_preview": "https://example.com/sustentabilidade_intro_44.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;",
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Propor políticas públicas que incentivem práticas sustentáveis;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas práticas e estudos de caso, enfatizando design UX/UI e programação móvel. Sessões síncronas e atividades assíncronas complementam a formação, proporcionando uma compreensão prática do desenvolvimento de aplicativos.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-28",
        "updatedAt": "2024-03-29",
        "id": 44
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 45",
        "description": "Explore o curso 'Desenvolvimento de Aplicações Móveis 45' com Prof. Tecnologia 45 para aprender sobre Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Com início em 2024-11-45, este curso médio inclui metodologias de ensino como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será feita através de A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e a bibliografia recomendada será A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 45",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-45",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em tecnologia",
        "reviews": null,
        "average_rating": 4.8,
        "total_reviews": 57,
        "cover_image": "https://example.com/tecnologia_45.png",
        "course_preview": "https://example.com/tecnologia_intro_45.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;",
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de desenvolvimento tecnológico. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "Os alunos serão avaliados através de: a) avaliação diagnóstica inicial, b) avaliação formativa durante as atividades do curso, e c) avaliação sumativa ao término do curso. A média ponderada será composta por: Portfólio individual: 50%, Participação nas sessões síncronas e assíncronas: 20%, Reflexão crítica final: 30%. Todos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-06-22",
        "id": 45
    },
    {
        "title": "Fundamentos da Saúde Pública 46",
        "description": "Neste curso, 'Fundamentos da Saúde Pública 46', ministrado por Prof. Saúde 46, você aprenderá sobre Saúde Comunitária., Avanços em Epidemiologia., Implementação de Políticas de Saúde., Projetos de Promoção da Saúde.. Com início em 2024-11-46, este curso longo será conduzido através de O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Saúde 46",
        "category": "Saúde",
        "tags": [
            "saúde",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-46",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.2,
        "total_reviews": 27,
        "cover_image": "https://example.com/saúde_46.png",
        "course_preview": "https://example.com/saúde_intro_46.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Analisar os desafios da epidemiologia moderna e as estratégias para enfrentá-los;",
                "Examinar os impactos das desigualdades sociais na saúde e as formas de mitigação;",
                "Capacitar os alunos para liderar projetos de saúde pública com enfoque em equidade.",
                "Identificar os principais determinantes sociais da saúde e suas implicações na prática clínica;",
                "Investigar as abordagens de promoção da saúde comunitária e sua eficácia;",
                "Desenvolver competências para a gestão e implementação de políticas de saúde pública;",
                "Explorar a evolução das políticas de saúde pública e sua aplicação em contextos atuais;",
                "Criticar as políticas de saúde vigentes e propor alternativas inovadoras;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de promover saúde comunitária e habilidades em pesquisa epidemiológica., essenciais para o sucesso em Saúde., essenciais para o sucesso em Saúde.",
            "contents": {
                "Módulo 1": "Saúde Comunitária.",
                "Módulo 2": "Avanços em Epidemiologia.",
                "Módulo 3": "Implementação de Políticas de Saúde.",
                "Módulo 4": "Projetos de Promoção da Saúde."
            },
            "methodologies": "O curso será desenvolvido na modalidade b-learning, integrando sessões presenciais e online. Os módulos serão disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas sessões plenárias e oficinas práticas focadas na análise de práticas de saúde pública, estudos de caso e estratégias de intervenção. Serão utilizadas ferramentas como videoconferências síncronas e atividades assíncronas no ambiente virtual.",
            "assessment": "A avaliação incluirá: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será determinada pela média ponderada de: Projeto colaborativo: 40%, Participação nas atividades: 30%, Apresentação final: 30%. Os alunos que completarem com sucesso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e recursos online., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-09-18",
        "id": 46
    },
    {
        "title": "Metodologias Ativas de Aprendizagem 47",
        "description": "Neste curso, 'Metodologias Ativas de Aprendizagem 47', ministrado por Prof. Educação 47, você aprenderá sobre Novas Metodologias de Ensino., Engajamento em Sala de Aula., Uso de Tecnologia na Educação., Melhoria de Resultados Educacionais.. Com início em 2024-11-47, este curso médio será conduzido através de O curso utilizará metodologias diversificadas, incluindo Projetos práticos e uso de tecnologias educacionais., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação incluirá A avaliação será contínua, com ênfase em Projetos práticos e apresentações.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., e a bibliografia recomendada será A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Educação 47",
        "category": "Educação",
        "tags": [
            "educação",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-47",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em educação",
        "reviews": [
            {
                "comentário": "Excelente curso, muito prático e informativo!",
                "nota": 5
            },
            {
                "comentário": "Bom material, mas esperava mais interacções em tempo real.",
                "nota": 4
            }
        ],
        "average_rating": 4.6,
        "total_reviews": 91,
        "cover_image": "https://example.com/educação_47.png",
        "course_preview": "https://example.com/educação_intro_47.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Propor práticas pedagógicas inclusivas que atendam à diversidade estudantil;",
                "Desenvolver competências para a avaliação de resultados educacionais e melhoria contínua;",
                "Analisar o impacto das tecnologias educacionais no engajamento dos alunos;",
                "Capacitar os educadores para a criação de ambientes de aprendizagem colaborativos;",
                "Implementar projetos educacionais que integrem diferentes áreas do conhecimento.",
                "Explorar as relações entre teoria educacional e prática pedagógica;",
                "Desenvolver estratégias para a implementação de metodologias ativas em sala de aula;",
                "Investigar as políticas educacionais que promovem a igualdade de oportunidades;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de inovar no ensino e engajar alunos em diferentes contextos., essenciais para o sucesso em Educação., essenciais para o sucesso em Educação.",
            "contents": {
                "Módulo 1": "Novas Metodologias de Ensino.",
                "Módulo 2": "Engajamento em Sala de Aula.",
                "Módulo 3": "Uso de Tecnologia na Educação.",
                "Módulo 4": "Melhoria de Resultados Educacionais."
            },
            "methodologies": "Este curso combina aprendizagem presencial e online, com módulos acessíveis em um ambiente de aprendizagem virtual. A metodologia inclui plenárias, oficinas e estudos de caso, enfatizando a análise crítica de políticas de saúde. Sessões síncronas e atividades assíncronas complementam a formação, promovendo uma compreensão abrangente dos desafios da saúde pública.",
            "assessment": "O curso utilizará três tipos de avaliação: a) avaliação diagnóstica no início, b) avaliação formativa ao longo do curso, e c) avaliação sumativa no final. A nota final será a média ponderada de: Relatório de pesquisa: 50%, Participação em fóruns: 20%, Autoavaliação: 30%. Aqueles que cumprirem os objetivos do curso receberão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Recursos online e workshops com educadores., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-07-13",
        "updatedAt": "2023-09-20",
        "id": 47
    },
    {
        "title": "Introdução à Análise de Negócios 48",
        "description": "O curso 'Introdução à Análise de Negócios 48', oferecido por Prof. Negócios 48, aborda temas cruciais como Análise Financeira Avançada., Gestão Estratégica., Gestão de Projetos Complexos., Inovação nos Negócios.. Com duração longo e início em 2024-11-48, os alunos irão se beneficiar de metodologias como O curso utilizará metodologias diversificadas, incluindo Estudos de caso e projetos práticos., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será baseada em A avaliação será contínua, com ênfase em Projetos práticos e participação em discussões.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., com uma bibliografia composta por A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Negócios 48",
        "category": "Negócios",
        "tags": [
            "negócios",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-48",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.4,
        "total_reviews": 70,
        "cover_image": "https://example.com/negócios_48.png",
        "course_preview": "https://example.com/negócios_intro_48.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver estratégias de gestão que promovam a sustentabilidade empresarial;",
                "Capacitar os alunos para a análise crítica de mercados e desenvolvimento de estratégias;",
                "Desenvolver competências em liderança e gestão de equipes multidisciplinares;",
                "Analisar os fundamentos da análise financeira e sua aplicação prática;",
                "Implementar planos de negócios que integrem práticas éticas e sustentáveis.",
                "Propor soluções inovadoras para os desafios de gestão de projetos complexos;",
                "Investigar as tendências globais de negócios e suas implicações locais;",
                "Explorar as políticas de responsabilidade social corporativa e sua implementação;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Capacidade de análise financeira detalhada e implementação de estratégias de negócios., essenciais para o sucesso em Negócios., essenciais para o sucesso em Negócios.",
            "contents": {
                "Módulo 1": "Análise Financeira Avançada.",
                "Módulo 2": "Gestão Estratégica.",
                "Módulo 3": "Gestão de Projetos Complexos.",
                "Módulo 4": "Inovação nos Negócios."
            },
            "methodologies": "Desenvolvido em b-learning, o curso oferece sessões presenciais e online, com todos os módulos disponíveis em um ambiente de aprendizagem virtual. Através de plenárias, oficinas práticas e análise de casos, os alunos explorarão teorias e práticas de saúde pública. Ferramentas de videoconferência serão utilizadas para sessões síncronas, complementadas por atividades assíncronas.",
            "assessment": "A avaliação do curso será baseada em: a) avaliação diagnóstica inicial, b) avaliação formativa contínua, e c) avaliação sumativa final. A classificação final será composta por: Projeto prático: 40%, Participação nas discussões: 30%, Relatório final: 30%. Os alunos que atingirem os objetivos definidos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Artigos acadêmicos e workshops com profissionais de negócios., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-08-20",
        "id": 48
    },
    {
        "title": "Estratégias de Sustentabilidade Empresarial 49",
        "description": "Participe do curso 'Estratégias de Sustentabilidade Empresarial 49' com Prof. Sustentabilidade 49 para explorar tópicos como Fundamentos da Sustentabilidade., Gestão de Recursos., Estratégias para Sustentabilidade., Avaliação de Impacto Ambiental.. Este curso, começando em 2024-11-49, tem uma duração médio e usa metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas e estudos de caso., proporcionando uma aprendizagem prática e teórica abrangente.. Os alunos serão avaliados através de A avaliação será contínua, com ênfase em Testes teóricos e análise de estudos de caso.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas. e terão acesso a uma bibliografia que inclui A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Sustentabilidade 49",
        "category": "Sustentabilidade",
        "tags": [
            "sustentabilidade",
            "curso",
            "aprendizado"
        ],
        "duration": "médio",
        "cost": "gratuito",
        "start_date": "2024-11-49",
        "format": "online",
        "prerequisite": "Conhecimentos básicos em sustentabilidade",
        "reviews": null,
        "average_rating": 4.3,
        "total_reviews": 97,
        "cover_image": "https://example.com/sustentabilidade_49.png",
        "course_preview": "https://example.com/sustentabilidade_intro_49.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Investigar as interações entre economia, sociedade e meio ambiente;",
                "Capacitar os alunos para liderar iniciativas de sustentabilidade em diversos setores;",
                "Implementar projetos de sustentabilidade com enfoque em inovação e responsabilidade.",
                "Explorar as práticas de sustentabilidade empresarial e seus benefícios;",
                "Desenvolver estratégias para a gestão eficiente de recursos naturais;",
                "Desenvolver competências para a implementação de sistemas de gestão ambiental;",
                "Propor políticas públicas que incentivem práticas sustentáveis;",
                "Analisar os métodos de avaliação de impacto ambiental e sua aplicação;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Habilidades em gestão de recursos e análise de impacto ambiental., essenciais para o sucesso em Sustentabilidade., essenciais para o sucesso em Sustentabilidade.",
            "contents": {
                "Módulo 1": "Fundamentos da Sustentabilidade.",
                "Módulo 2": "Gestão de Recursos.",
                "Módulo 3": "Estratégias para Sustentabilidade.",
                "Módulo 4": "Avaliação de Impacto Ambiental."
            },
            "methodologies": "O curso adota uma abordagem b-learning, combinando sessões presenciais e online, com módulos disponibilizados em um ambiente de aprendizagem virtual. Serão realizadas plenárias, oficinas práticas e estudos de caso, focando na educação intercultural e plurilinguismo. Ferramentas de videoconferência serão utilizadas para sessões síncronas, e atividades assíncronas serão conduzidas no ambiente virtual.",
            "assessment": "A avaliação baseia-se em três vetores: a) avaliação diagnóstica no início do curso, b) avaliação formativa durante o curso, e c) avaliação sumativa no final do curso. A classificação final resultará da média ponderada, numa escala de 20 pontos, das classificações parcelares, com as seguintes ponderações: Projeto de pesquisa: 50%, Participação nas discussões: 20%, Relatório final: 30%. Todos os formandos que atingirem os objetivos definidos obterão um Certificado.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Livros sobre sustentabilidade e artigos acadêmicos., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2023-12-03",
        "id": 49
    },
    {
        "title": "Desenvolvimento de Aplicações Móveis 50",
        "description": "O curso 'Desenvolvimento de Aplicações Móveis 50', oferecido por Prof. Tecnologia 50, aborda temas cruciais como Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados., Metodologias e técnicas avançadas, com exemplos práticos., Estudos de caso e aplicação prática, com projetos colaborativos., Avaliação final e integração dos conhecimentos adquiridos.. Com duração longo e início em 2024-11-50, os alunos irão se beneficiar de metodologias como O curso utilizará metodologias diversificadas, incluindo Aulas teóricas expositivas, estudos de caso práticos baseados em situações reais, trabalho colaborativo em projetos de pesquisa, e uso de tecnologia como simulações e ferramentas de análise digital., proporcionando uma aprendizagem prática e teórica abrangente.. A avaliação será baseada em A avaliação será contínua, com ênfase em Métodos de avaliação contínua incluem testes teóricos, projetos práticos em grupo, apresentações orais, e participação ativa em discussões online. Exemplos específicos incluem a criação de um plano de negócios ou a análise de um estudo de caso de saúde pública.. Os alunos serão desafiados a aplicar os conhecimentos adquiridos em situações práticas., com uma bibliografia composta por A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento..",
        "trainer": "Prof. Tecnologia 50",
        "category": "Tecnologia",
        "tags": [
            "tecnologia",
            "curso",
            "aprendizado"
        ],
        "duration": "longo",
        "cost": "gratuito",
        "start_date": "2024-11-50",
        "format": "online",
        "prerequisite": "Nenhum",
        "reviews": null,
        "average_rating": 4.1,
        "total_reviews": 26,
        "cover_image": "https://example.com/tecnologia_50.png",
        "course_preview": "https://example.com/tecnologia_intro_50.mp4",
        "accessibility_resources": "Disponível em libras e com legendas",
        "certification": "sim",
        "language": "Português",
        "program": {
            "objectives": [
                "Desenvolver projetos colaborativos que integrem diferentes tecnologias emergentes.",
                "Analisar as metodologias de design UX/UI e sua importância na criação de apps;",
                "Desenvolver competências em programação para plataformas Android e iOS;",
                "Investigar as melhores práticas para publicação e monetização de aplicativos;",
                "Implementar estratégias de teste e otimização de aplicativos móveis;",
                "Explorar as últimas tendências em desenvolvimento de aplicações móveis;",
                "Propor soluções tecnológicas que atendam a necessidades específicas do mercado;",
                "Capacitar os alunos para a criação de protótipos funcionais e inovadores;"
            ],
            "competencies": "Os alunos desenvolverão competências em Os alunos desenvolverão competências em Desenvolvimento de habilidades técnicas como análise de dados e programação. Capacidade analítica e crítica, exemplificada pela análise de estudos de caso complexos. Habilidades interpessoais, como comunicação eficaz em equipes multidisciplinares e liderança., essenciais para o sucesso em Tecnologia., essenciais para o sucesso em Tecnologia.",
            "contents": {
                "Módulo 1": "Introdução e conceitos básicos, incluindo uma visão geral dos temas abordados.",
                "Módulo 2": "Metodologias e técnicas avançadas, com exemplos práticos.",
                "Módulo 3": "Estudos de caso e aplicação prática, com projetos colaborativos.",
                "Módulo 4": "Avaliação final e integração dos conhecimentos adquiridos."
            },
            "methodologies": "Este curso utiliza metodologias b-learning, com módulos acessíveis online e sessões presenciais. As plenárias e oficinas práticas abordarão teorias educacionais e práticas interculturais, usando estudos de caso para ilustrar conceitos. Sessões síncronas e atividades assíncronas no ambiente virtual serão componentes chave do curso.",
            "assessment": "A avaliação será contínua e inclui: a) avaliação diagnóstica no início do curso, b) avaliação formativa ao longo do curso, e c) avaliação sumativa ao final. A classificação final será calculada com base na média ponderada de: Estudo de caso: 40%, Participação ativa: 30%, Projeto final: 30%. Os alunos que alcançarem os objetivos receberão um Certificado de Conclusão.",
            "bibliography": "A bibliografia do curso incluirá A bibliografia do curso incluirá Principais livros e artigos acadêmicos, recursos online como bases de dados digitais, e workshops conduzidos por profissionais experientes. Referências específicas incluem títulos como 'Fundamentos de Saúde Pública' e 'Estratégias Empresariais Sustentáveis'., oferecendo uma base sólida de conhecimento., oferecendo uma base sólida de conhecimento."
        },
        "createdAt": "2024-02-06",
        "id": 50
    }
]